"""
    Дана строка, разбить ее на слова. Слова разделены одним пробелом
    "Александр Сергеевич Пушкин" -> ["Александр", "Сергеевич", "Пушкин"]
"""


def get_words(s: str) -> list[str]:
    return s.split()


if __name__ == "__main__":

    test_strings = [
        'а роза упала на лапу азора',
        'Александр Сергеевич Пушкин',
        'литс или стил'
    ]
    for num in test_strings:
        print(f"{num}: {get_words(num)}")

